Repository: zacks2512/familyCal
Catalog: lib/l10n/app_*.arb
Languages: he

# appTagline
source: Coordinate family schedules. Never miss a drop-off or pickup.
he: תיאום לוחות זמנים משפחתיים. לעולם לא תפספסו הורדה או איסוף.

source: Register
he: הרשמה

source: Log In
he: התחברות

# termsAndPrivacy
source: By continuing, you agree to our Terms of Service and Privacy Policy
he: בהמשך, אתם מסכימים לתנאי השירות ומדיניות הפרטיות שלנו

# registerTitle
source: Register
he: הרשמה

# registerSubtitle
source: Choose how you'd like to register
he: בחרו כיצד תרצו להירשם

# loginTitle
source: Log In
he: התחברות

# loginSubtitle
source: Choose how you'd like to log in
he: בחרו כיצד תרצו להתחבר

source: Continue with Google
he: המשך עם Google

source: Continue with Facebook
he: המשך עם Facebook

# orDivider
source: or
he: או

# registerWithEmailPhone
source: Register with Email or Phone
he: הרשמה באמצעות אימייל או טלפון

# loginWithEmailPhone
source: Log In with Email or Phone
he: התחברות באמצעות אימייל או טלפון

# facebookComingSoon
source: Facebook Sign-In coming soon!
he: התחברות עם Facebook בקרוב!

# signupTitle
source: Create Account
he: יצירת חשבון

# signupSubtitle
source: Enter your details to get started
he: הזינו את הפרטים שלכם כדי להתחיל

source: Full Name
he: שם מלא

source: Enter your name
he: הזינו את שמכם

source: Please enter your name
he: אנא הזינו את שמכם

source: Contact Method
he: שיטת יצירת קשר

source: Email
he: אימייל

source: Phone
he: טלפון

source: Email Address
he: כתובת אימייל

source: Enter your email
he: הזינו את האימייל שלכם

# pleaseEnterEmail
source: Please enter your email
he: אנא הזינו את האימייל שלכם

# pleaseEnterValidEmail
source: Please enter a valid email
he: אנא הזינו כתובת אימייל תקינה

source: Phone Number
he: מספר טלפון

source: Enter phone number
he: הזינו מספר טלפון

# pleaseEnterPhoneNumber
source: Please enter your phone number
he: אנא הזינו את מספר הטלפון שלכם

# pleaseEnterValidPhoneNumber
source: Please enter a valid phone number
he: אנא הזינו מספר טלפון תקין

source: Language
he: שפה

# continueButton
source: Continue
he: המשך

# alreadyHaveAccount
source: Already have an account?
he: כבר יש לכם חשבון?

# verificationTitle
source: Verify Your {method}
he: אימות {method} שלכם

# verificationCodeSent
source: We sent a 6-digit code to
he: שלחנו קוד בן 6 ספרות אל

# enterCodeBelow
source: Enter the code below to continue
he: הזינו את הקוד למטה כדי להמשיך

source: Verification Code
he: קוד אימות

# enterCode
source: Enter 6-digit code
he: הזינו קוד בן 6 ספרות

# pleaseEnterCode
source: Please enter the verification code
he: אנא הזינו את קוד האימות

source: Code must be 6 digits
he: הקוד חייב להיות בן 6 ספרות

source: Verify
he: אמת

# didntReceiveCode
source: Didn't receive the code?
he: לא קיבלתם את הקוד?

source: Resend
he: שלח שוב

source: Calendar
he: לוח שנה

source: Settings
he: הגדרות

# settingsTitle
source: Settings
he: הגדרות

source: Account
he: חשבון

source: Sign Out
he: התנתק

source: Children
he: ילדים

source: Add Child
he: הוספת ילד

source: Family Members
he: בני משפחה

source: Add Member
he: הוסף חבר

source: Activity Log
he: יומן פעילות

source: View Activity Log
he: צפה ביומן פעילות

source: Day
he: יום

source: Week
he: שבוע

source: Month
he: חודש

source: Today
he: היום

source: Add Event
he: הוסף אירוע

# noEventsYetMessage
source: No events yet. Add one to get started.
he: אין אירועים עדיין. הוסיפו אחד כדי להתחיל.

# noEventsScheduledMessage
source: No events scheduled for this day.
he: אין אירועים מתוכננים ליום זה.

# noEventsShort
source: No events
he: אין אירועים

# eventAddedMessage
source: Added {eventTitle}
he: האירוע {eventTitle} נוסף

# familySetupTitle
source: Let's Set Up Your Family
he: בואו נגדיר את המשפחה שלכם

# stepXOfY
source: Step {current} of {total}
he: שלב {current} מתוך {total}

# familySetupCreateTitle
source: Create Your Family
he: צרו את המשפחה שלכם

# familySetupCreateSubtitle
source: Let's start by giving your family a name
he: נתחיל במתן שם למשפחה שלכם

# familyNameLabel
source: Family Name
he: שם המשפחה

# familyNameHint
source: e.g., The Smiths, Johnson Family
he: לדוגמה: משפחת כהן, משפחת לוי

# pleaseEnterFamilyName
source: Please enter a family name
he: אנא הזינו שם משפחה

# familyNameHelper
source: You can change this later in settings
he: ניתן לשנות זאת מאוחר יותר בהגדרות

# addFamilyMembersTitle
source: Add Family Members
he: הוסיפו בני משפחה

# inviteFamilyMembersTitle
source: Invite Family Members
he: הזמינו בני משפחה

# inviteFamilyMembersSubtitle
source: Send invite links to your partner, grandparents, or anyone who helps
he: שלחו קישורי הזמנה לבן/בת הזוג, לסבים ולכל מי שעוזר

# noInvitesYetTitle
source: No invites sent yet
he: לא נשלחו הזמנות עדיין

# noInvitesYetSubtitle
source: Send links to people who will help coordinate your family schedules
he: שלחו קישורים לאנשים שיעזרו לתאם את לוחות הזמנים

source: Send Invite
he: שלחו הזמנה

source: Send Another Invite
he: שלחו הזמנה נוספת

source: Skip for Now
he: דלגו לעת עתה

# sendInviteToJoinTitle
source: Send Invite to Join {familyName}
he: שליחת הזמנה להצטרף ל{familyName}

source: Email or Phone
he: אימייל או טלפון

# emailHintGeneric
source: their@email.com
he: לדוגמה: example@email.com

source: Switch to phone
he: החלפה לטלפון

source: Switch to email
he: החלפה לאימייל

# inviteInfo
source: We'll create an invite link you can share
he: ניצור קישור הזמנה שתוכלו לשתף

# createAndCopyLink
source: Create & Copy Link
he: יצירת קישור והעתקה

# inviteLinkCopied
source: Invite link copied! Share it with {contact}
he: קישור ההזמנה הועתק! שתפו אותו עם {contact}

source: Share
he: שתף

source: Invite sent ✓
he: הזמנה נשלחה ✓

# exitSetupTitle
source: Exit setup?
he: לצאת מההגדרה?

# exitSetupMessage
source: Your progress will be lost.
he: ההתקדמות שלכם תאבד.

source: Continue setup
he: המשך בהגדרה

# welcomeAfterSetupTitle
source: Welcome to FamilyCal!
he: ברוכים הבאים ל‑FamilyCal!

# welcomeAfterSetupBody
source: Invite family members in Settings to share your calendar. Then add events together.
he: הזמינו בני משפחה בהגדרות כדי לשתף את לוח הזמנים שלכם. אחר כך הוסיפו אירועים ביחד.

source: Got it
he: הבנתי

# onboardingStepFamily
source: Family
he: משפחה

# onboardingStepMembers
source: Members
he: חברים

# onboardingStepChildren
source: Children
he: ילדים

# addChildrenAppBar
source: Add Children
he: הוסיפו ילדים

# addYourChildrenTitle
source: Add Your Children
he: הוסיפו את ילדיכם

# addYourChildrenSubtitle
source: Add the kids you'll be coordinating schedules for
he: הוסיפו את הילדים שעבורם תתאמו לוחות זמנים

# noChildrenYetTitle
source: No children yet
he: אין ילדים עדיין

# noChildrenYetSubtitle
source: Add the kids you'll track schedules for
he: הוסיפו את הילדים שתעקבו אחר לוחות הזמנים שלהם

source: Add Another Child
he: הוספת ילד נוסף

source: Finish Setup
he: סיום ההגדרה

# noChildrenAddedTitle
source: No Children Added
he: לא נוספו ילדים

# noChildrenAddedMessage
source: You haven't added any children yet. You can add them later from settings.\n\nContinue anyway?
he: לא הוספתם ילדים. ניתן להוסיף אותם מאוחר יותר דרך ההגדרות. להמשיך בכל מקרה?

source: Go Back
he: חזרה

# childNameLabel
source: Child's Name
he: שם הילד/ה

source: Enter their name
he: הזינו את שמו/שמה

source: Please enter a name
he: אנא הזינו שם

source: Choose a color
he: בחרו צבע

# colorPink
source: Pink
he: ורוד

# colorOrange
source: Orange
he: כתום

# colorBlue
source: Blue
he: כחול

# colorGreen
source: Green
he: ירוק

# colorPurple
source: Purple
he: סגול

# colorRed
source: Red
he: אדום

# colorTeal
source: Teal
he: טורקיז

# colorAmber
source: Amber
he: ענבר

source: Cancel
he: ביטול

# noAccountPleaseRegister
source: No account found for this Google address. Please register first or use your invite link.
he: לא נמצא חשבון לכתובת Google הזו. אנא הירשמו תחילה או השתמשו בקישור ההזמנה.

# emailAlreadyRegistered
source: This email is already registered. Please log in instead.
he: כתובת דוא״ל זו כבר רשומה. אנא התחברו במקום זאת.

source: Login cancelled
he: ההתחברות בוטלה

# eventNeedsResponsible
source: Event needs responsible person
he: האירוע זקוק לאדם אחראי

source: Save
he: שמור

source: OK
he: אישור

# addEventNeedsChild
source: Add at least one child before scheduling events.
he: הוסיפו לפחות ילד אחד לפני יצירת אירועים.

# addEventTitleLabel
source: Title
he: כותרת

# addEventTitleRequired
source: Enter a title
he: הזינו כותרת

# addEventStartLabel
source: Start
he: התחלה

# addEventEndLabel
source: End
he: סיום

# addEventChildLabel
source: Child
he: ילד/ה

# addEventChildRequired
source: Select a child
he: בחרו ילד/ה

# addEventPlaceLabel
source: Place (optional)
he: מקום (לא חובה)

# addEventPlaceHint
source: School, gym, home, etc.
he: בית ספר, חוג, בית וכו׳

# addEventAssignLabel
source: Assign to
he: שייך ל

# addEventUnassigned
source: Unassigned
he: ללא שיוך

# addEventRepeatLabel
source: Repeat
he: חזרה

# addEventRepeatNone
source: Don't repeat
he: ללא חזרה

# addEventRepeatDaily
source: Every day
he: כל יום

# addEventRepeatWeekly
source: Every week
he: כל שבוע

# addEventRepeatMonthly
source: Every month
he: כל חודש

# addEventRepeatYearly
source: Every year
he: כל שנה

# addEventRepeatUntilOptional
source: Repeat until… (optional)
he: חזרה עד… (לא חובה)

# addEventRepeatUntilDate
source: Until: {date}
he: עד: {date}

# addEventEndTimeError
source: End time must be after the start time.
he: שעת הסיום חייבת להיות אחרי שעת ההתחלה.

# eventRoleDropOff
source: Drop-off
he: הורדה

# eventRolePickUp
source: Pick-up
he: איסוף

# addEventAssignSegment
source: Assign pickup/drop-off
he: שייך איסוף/הורדה

# addEventRepeatDialogTitle
source: Repeat
he: חזרה

# addEventSelectTimeTitle
source: Select time
he: בחרו שעה

source: Delete
he: מחק

# eventUpdatedMessage
source: Updated {title}
he: עודכן {title}

# deleteEventTitle
source: Delete event?
he: למחוק את האירוע?

# deleteEventConfirmation
source: Are you sure you want to delete "{title}"?
he: האם למחוק את "{title}"?

# eventDeletedMessage
source: Event deleted
he: האירוע נמחק

source: Edit event
he: עריכת אירוע
